--- !ruby/object:Provider::Ansible::Example
task: !ruby/object:Provider::Ansible::Task
  name: azure_rm_securityinsightbookmark
  description: Creates or updates a bookmark.
  code:
    resource_group: myResourceGroup
    operational_insights_resource_provider: Microsoft.OperationalInsights
    name: myWorkspace
    bookmark_id: myBookmark
    bookmark:
      id: >-
        /subscriptions/{{ subscription_id }}/resourceGroups/{{ resource_group
        }}/providers/Microsoft.OperationalIinsights/workspaces/{{ workspace_name
        }}/providers/Microsoft.SecurityInsights/bookmarks/{{ bookmark_name }}
      name: 73e01a99-5cd7-4139-a149-9f2736ff2ab5
      type: Microsoft.SecurityInsights/bookmarks
      etag: '"0300bf09-0000-0000-0000-5c37296e0000"'
      properties:
        displayName: My bookmark
        createdBy:
          objectId: 2046feea-040d-4a46-9e2b-91c2941bfa70
          email: john@contoso.com
          name: john doe
        updatedBy:
          objectId: 2046feea-040d-4a46-9e2b-91c2941bfa70
          email: john@contoso.com
          name: john doe
        updated: '2019-01-01T13:15:30Z'
        created: '2019-01-01T13:15:30Z'
        notes: Found a suspicious activity
        labels:
          - Tag1
          - Tag2
        query: >-
          SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated <
          ago(2d)
        queryResult: Security Event query result
  